## Rich Demerara Syrup

2 cups Demerara sugar
1 cup hot water 

In a small sauce pan, combine Demerara sugar and water. Stir over heat until sugar is completely dissolved. Remove from heat and let cool.

https://www.youtube.com/watch?v=CvEDhkR6K14


## Cinnamon Syrup

1.5 cups white sugar
1 cup hot water 
4 cinnamon sticks

In a small sauce pan, combine sugar and water. Stir over heat until sugar is completely dissolved. Add cinnamon sticks and simmer for 2 minutes. Remove from heat and allow cinnamon to steep for 6-12 hours. Remove cinnamon sticks once steeping is complete.

https://www.youtube.com/watch?v=CvEDhkR6K14


## Grenadine Syrup

3 cups white sugar
2 cups 100% pomegranate juice
1 tsp pomegranate molasses 
1/2 tsp rose water

In a medium sauce pan, combine sugar, pomegranate juice, and pomegranate molasses. Stir over heat until sugar is completely dissolved. Remove from heat and add rose water. Stir to combine.

https://www.youtube.com/watch?v=CvEDhkR6K14


## Orgeat Syrup

3 cups white sugar
2 cups unsweetened almond milk
1 tsp orange blossom water
1/2 tsp rose water
1/2 tsp almond extract

In a medium sauce pan, combine sugar and almond milk. Stir over heat until sugar is completely dissolved. Remove from heat and add orange blossom water, rose water, and almond extract. Stir to combine.

https://www.youtube.com/watch?v=CvEDhkR6K14


## Passion Fruit Syrup

14 oz. (397g) frozen passion fruit pulp
2.5 cups (600ml) white sugar

In a medium sauce pan, combine passion fruit pulp and sugar. Stir over heat until sugar is completely dissolved. Remove from heat and let cool.

https://www.youtube.com/watch?v=vGBMrJgjZB4


## Raspberry Syrup

3/4 cup (180ml) white sugar
3/4 cup (180ml) hot water 
6 oz. (170g) raspberries

In a small sauce pan, combine sugar and water. Stir over heat until sugar is completely dissolved. In a medium jar, lightly crush raspberries. Pour simple syrup over raspberries in jar. Seal and steep in refrigerator for up to 24 hours. Strain syrup with a fine mesh strainer once steeping is complete.

https://www.youtube.com/watch?v=vGBMrJgjZB4


## Ginger Syrup

1.5 cups (360ml) white sugar
1 cup (240ml) water
250g fresh ginger

Begin by using a spoon to peel the ginger (optional). Slice ginger into small pieces. Set aside. In a medium sauce pan, combine sugar and water. Stir over heat until sugar is completely dissolved. Add sliced ginger and simmer for 3-5 minutes. Remove from heat. Seal and steep in refrigerator for up to 24 hours. Strain syrup with a fine mesh strainer once steeping is complete.

https://www.youtube.com/watch?v=vGBMrJgjZB4


## Cream of Coconut

1.75 cups (420ml) white sugar
13.5 oz. (400ml) unsweetened full fat coconut milk (1 can)
Pinch of salt

In a medium sauce pan, combine sugar, coconut milk, and salt. Stir over heat until sugar is completely dissolved. That’s it!

https://www.youtube.com/watch?v=vGBMrJgjZB4


## Raspberry Syrup

1 cup (125g) fresh raspberries
2 cups (400g) superfine sugar
1 cup (230ml) water

1. Add raspberries and sugar into saucepan and muddle together.
2. Add water and bring to a simmer.
3. Stir and simmer for 10 minutes.
4. Strain into container.
5. Add a touch of vodka to help preserve.
6. Store in refrigerator for up to a month.